#include "Title.h"

#include "Title.h"
#include"PadInput.h"
#include"DxLib.h"



//-----------------------------------
// コンストラクタ
//-----------------------------------
Title::Title()
{

}

//-----------------------------------
// デストラクタ
//-----------------------------------
Title::~Title()
{

}

//-----------------------------------
// 更新
//-----------------------------------
AbstractScene* Title::Update()
{

	return this;
}

//-----------------------------------
// 描画
//-----------------------------------
void Title::Draw()const
{

	DrawFormatString(550, 400, 0xFFFFFF, "放置ゲーム的な");

}